Revit 2026 API

# SlabShapeEditorResetSlabShape Method

---

Removes the modifications made during editing and resets the element geometry back to the unmodified state.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ResetSlabShape()
```
```vb
Public Sub ResetSlabShape
```
```cpp
public:
void ResetSlabShape()
```
```fsharp
member ResetSlabShape : unit -> unit
```

Calling this method will reset the slab back to its original state and disable Slab Shape Editing. If further editing is needed, call Enable again.

#### Reference

SlabShapeEditor Class

Autodesk.Revit.DB Namespace